/**
 * Energya Cables - Supervisors & Machine Operators Directory (213 Registered Personnel)
 */
export const SUPERVISOR_MAP = {
  0: "غير محدد (0)", 1: "رمضان احمد شحاته (1791)", 15: "محمد عبدالرحمن احمد (1351)", 17: "محمد حسني عبد الرؤوف (9425)", 32: "محمد محمد حسيني (9773)",
  47: "ايمن عبد الحميد عبد القادر (9740)", 61: "رشدي محمد عبدالعظيم (2493)", 62: "محمد حسني ضاحي (1319)", 77: "محمد سامي مصطفي (1765)", 79: "محمد ابراهيم محمود (2193)",
  90: "احمد محمد مصطفي محمد (2246)", 96: "علي محمد علي كامل (2411)", 100: "محمد السيد محمد (9430)", 105: "محمود حسين عبد الحليم (1652)", 107: "عطيه شوقي عبد الفتاح (497)",
  108: "احمد محمد مصطفي (9355)", 110: "محمد وائل عبد الجليل (9690)", 111: "عبده علي عبد المعبود (9814)", 114: "احمد عبد الحميد السيد (9357)", 115: "محمد اشرف حسين (9354)",
  117: "رضا صلاح علي (9636)", 119: "محمد عبدالفتاح فهمي (9874)", 120: "احمد محمد عبد السميع (9973)", 123: "محمد مجدي حسين (2003)", 126: "محمد احمد كامل (9319)",
  128: "عبد الغني محمد ابراهيم (9763)", 132: "شريف رمضان عبد العظيم (1787)", 133: "محمود حشمت عبدالجواد (151)", 134: "محمد محرز السعيد (9359)", 135: "احمد عبد الله جوده (9812)",
  141: "محمود حمدي صابر (9307)", 142: "وائل عبد العليم محمد (1615)", 143: "احمد محمد محمد الشحات (9390)", 144: "احمد مجدي شريف (9627)", 148: "حامد وجيه حامد (9824)",
  150: "صلاح عادل عبد النبي (9243)", 152: "محمد فوزي محمد (9239)", 153: "محمد امام الشافعي (1800)", 155: "محمود صلاح محمد (9559)", 159: "يسري خليفة محمد (1649)",
  160: "احمد عبد القادر احمد (1576)", 161: "علاء الصباحي محمد (266)", 165: "احمد فوزي رضوان (1557)", 166: "احمد سامح عبد الحميد (9919)", 167: "محمد ابراهيم الدسوقي (1736)",
  172: "وحيد محمد عبدالرحيم (326)", 173: "احمد عبده السيد (95)", 174: "حازم حامد وهبه (150)", 175: "محمد عصمت محمد (1433)", 176: "سيد ماهر السيد (41)",
  177: "رمضان صبري السيد (1610)", 184: "محمد عادل عبدالحي (1153)", 185: "محمد حسين حسن ابراهيم (1633)", 186: "محمد علي احمد محمود (2470)", 188: "مصطفي محمود حافظ (9039)",
  189: "محمود احمد عبدالعزيز (9883)", 190: "فؤاد توفيق فؤاد (1833)", 194: "عبدالرحمن محمد ابويحيي (9796)", 195: "احمد فرج شحاته (9246)", 196: "علي محمد علي بنداري (9608)",
  197: "محمد عادل فتحي (9460)", 198: "احمد ابراهيم صلاح (2013)", 200: "محمد احمد محمدي مسلم (9806)", 204: "محمد مجدي الشحات (9296)", 205: "رضا محمد حسن (9126)",
  206: "احمد سمير سلامه (1763)", 207: "ابراهيم حسين ابراهيم (9595)", 208: "رشدي محمد حسانين (9198)", 209: "عادل صالح محمد محمد (1637)", 210: "محمد عمر مصطفي (9946)",
  216: "حلمي محمد خليل ابراهيم (2445)", 217: "احمد امين السيد عبدالمقصود (1639)", 218: "ضياء عبدالمنعم عبدالفتاح (848)", 220: "عادل فتحي عبدالقادر عبدالله (2207)", 223: "محمد محمود شعبان عطيه (1861)",
  224: "زياد سلامه زكي محمد موسي (1866)", 225: "علاء حسن محمد (292)", 226: "ناصر محمد عبدالفتاح (1257)", 227: "محمد ثابت عبد الغنى (140)", 229: "محمد متولى عيسى (387)",
  230: "اسلام اسماعيل محمد (1788)", 231: "محمود امام السيد (9146)", 232: "احمد عاطف صبحي (9123)", 233: "محمد عبدالناصر فكري (9841)", 234: "محمد محمد السيد الشيخ (2045)",
  236: "خالد محمد عبدالفتاح (9387)", 241: "محمد سليمان محمد (1105)", 242: "السيد سمير السيد (2220)", 243: "محمد ياسر نور الدين (9374)", 244: "كريم ايهاب عبدالوهاب (9305)",
  245: "محمد سمير عبدالفتاح (9613)", 246: "اسلام فايز محمد محمد (9642)", 249: "نادر ابراهيم محمد (2113)", 254: "محمود سمير اسماعيل (1014)", 255: "صالح رمضان شفيق (9300)",
  256: "علي محمد عبدالمقصود (9828)", 261: "محمد محمد مصطفي شاهين (9839)", 264: "حسين سعيد جوده الشع (1650)", 266: "احمد السيد على (904)", 267: "السيد محمد السيد ابواليزيد (9717)",
  272: "محمد هاني محمد جمعه (9911)", 276: "محمد محمود عبدالرؤوف (9328)", 282: "ابراهيم رمزي محمود (9794)", 288: "احمد محمد فياض علي (2464)", 289: "محمد عزت السعيد (283)",
  290: "محمد نصر مصطفي (9225)", 303: "محمد محمد محمود متولي (2461)", 304: "عبدالرحمن محمد عبدالرحمن (1158)", 305: "عبدالعظيم مصطفي السيد (196)", 319: "محمد السيد محمد (9233)",
  320: "مؤمن صلاح عطيه زيد (9188)", 321: "السيد السيد ابراهيم (9605)", 322: "زياد وحيد صابر سعيد (2052)", 323: "عبدالله عثمان امين (9886)", 328: "طارق حسين محمد الهادي (9606)",
  329: "اسامه سعيد فهمى (914)", 330: "محمد عباس عطا محمد (1013)", 331: "احمد السيد رجب (9986)", 332: "محمد جميل محمد رمضان (9831)", 336: "محمود محمد رضا نصر (1870)",
  337: "احمد نجاح السيد (9127)", 338: "احمد عبدالعليم عبدالعزيز (9639)", 339: "محمد يحيى عبدالعليم (388)", 340: "حازم امام حامد (2236)", 341: "محمد ناصر عبدالله سويلم (1993)",
  342: "عزت ياسر عزت باشا (9679)", 345: "كريم محمود السيد (1956)", 346: "احمد حسن احمد (15)", 347: "عبدالله شكري عبدالله (1975)", 349: "عبدالرحمن السيد مصطفي (2130)",
  350: "محمد ناجح فتحي (1981)", 351: "عبدالله اشرف عبدالعظيم (9826)", 352: "محمود عزت عبدالفتاح (1296)", 355: "احمد نادي ابوعجيله (9348)", 356: "محمد علي محمد (9655)",
  357: "احمد ضياء فخري عبدالجواد (2006)", 358: "عبدالله حافظ جبر (467)", 361: "محمد طه بهي (9223)", 363: "ياسر محمود توفيق (313)", 366: "سليمان يوسف محمود سليمان (9837)",
  367: "ايهاب محمد عبدالمجيد (1387)", 368: "ايهاب سعيد محمد (367)", 369: "حمدى ماهر حسن (280)", 370: "سعد احمد محمد شتا (1107)", 371: "احمد على ابراهيم (9125)",
  372: "عاطف عبدالفتاح محمد (1749)", 374: "احمد ماهر عبدالفتاح (9725)", 377: "احمد محمد احمد علي (9890)", 378: "عمر حسن عبدالمولي (1789)", 379: "محمد حمدى سيد عبد الله (1745)",
  380: "علي احمد محمد علي (1751)", 381: "محمد عطيه ابراهيم (9197)", 382: "محمد السيد حسني (9686)", 383: "محمد منتصر ابراهيم (9885)", 384: "محمد صلاح محمد مطلق (9974)",
  385: "محمود محمد وجدي (9682)", 386: "الحسيني فرج جمال (9656)", 388: "عبدالعظيم صلاح عبدالرؤوف (1931)", 389: "محمد السيد عباس (2159)", 390: "احمد محمد محمود ابوالخير (2197)",
  391: "محمد السيد الشبراوي (9379)", 392: "قاسم عبدالله قاسم (978)", 393: "حسن ابراهيم اسماعيل (9378)", 394: "احمد عبدالجيد محمد (9401)", 395: "احمد حسن عطيه (9377)",
  396: "عبدالجليل بدوي متولي (9719)", 404: "محمود محمد عبدالوهاب (9097)", 405: "اسلام اشرف عبدالحميد احمد (9914)", 406: "عمار محمد عبدالفتاح (9966)", 408: "عبدالرحمن سليمان محمد سليمان (9938)",
  409: "يوسف جلال محمد كامل (1933)", 412: "مجدى السيد الدمرداش (598)", 413: "عبدالله السيد عبدالله (264)", 414: "محمد عبد الحميد على (380)", 416: "اسلام بدوي السيد (9406)",
  417: "محمد يسري حسن (1755)", 418: "كامل محمد محمود (1229)", 419: "ابراهيم محمد ابراهيم محمد (1744)", 420: "احمد طلبه احمد حميده (1809)", 421: "محمد خالد احمد علي (9818)",
  422: "عمرو احمد السيد (1946)", 423: "احمد عماد محمود السعيد (9314)", 424: "إسماعيل محمد بندارى (790)", 425: "رضا السيد اسماعيل (348)", 426: "محمد الشحات ابراهيم (9007)",
  428: "السيد محمد عبدالفتاح (929)", 430: "عادل محمد رمضان (1403)", 431: "عطيه محمد عيد (852)", 432: "احمد فتوح السيد مصطفى (854)", 433: "اسماعيل عصام اسماعيل محمد (1882)",
  434: "وائل محمد حسن (2121)", 436: "احمد زكريا ابراهيم (421)", 447: "محمود ابراهيم الدسوقى (209)", 448: "محمود عبدالحميد محمد (1591)", 449: "محمد شملول محمد (138)",
  454: "محمد متولي عبده (1264)", 455: "احمد زكريا شحاته (1767)", 465: "محمد السيد كمال الدين محمد (2186)", 468: "سمير فوزي عبدالغني (2200)", 469: "أحمد محمود محمود سلامة (1564)",
  471: "محمد محمد خيري (882)", 477: "فارس السيد محمد مرسي (9877)", 480: "منصور عاطف منصور (1683)", 491: "احمد محمد عبدالحميد (9308)", 493: "مصطفى محمود عبده (2549)",
  502: "حماد عبدالعال طه حماد (1555)", 504: "محمد ثابت محمد عمر (9174)", 519: "شريف احمد محمد حسن (153)", 520: "محمد صابر صالح (9260)", 522: "اسلام صبحي محمد علي (2505)",
  523: "ياسر متولى شركس (917)", 524: "مسعد دسوقى عبدالرحمن (187)", 526: "محمد عبدالقادر عبدالله (645)"
};

export function getSupervisorName(id) {
  return SUPERVISOR_MAP[id] || `مشرف رقم (${id})`;
}
